import React from "react";

function Main() {
    return (
        <main className="h-screen p-2 bg-gray-500  border-2 border-black   items-center h-full">   
                <h1 className="text-4xl flex justify-center">Main</h1>
                <p className="text-xl flex justify-center">
                    ผมชื่อ [ชื่อของคุณ] และเป็นนักพัฒนาซอฟต์แวร์ที่มีความหลงใหลในการสร้างสรรค์และพัฒนาเทคโนโลยีที่สามารถเปลี่ยนแปลงโลกให้ดีขึ้น ผมเริ่มต้นอาชีพในวงการเทคโนโลยีเมื่อ [ระยะเวลา] และในระหว่างเวลาที่ผ่านมาผมได้รับประสบการณ์จากการทำงานในหลายโครงการที่ท้าทายและให้ผลลัพธ์ที่ดี

                    ผมจบการศึกษาจาก [ชื่อสถาบัน] ในสาขาวิชา [ชื่อสาขาวิชา] ซึ่งช่วยปูพื้นฐานและพัฒนาทักษะทางเทคนิคที่สำคัญสำหรับการทำงานในวงการพัฒนาเว็บและแอปพลิเคชัน หลังจากที่จบการศึกษา ผมได้เริ่มต้นการทำงานในตำแหน่ง [ตำแหน่งงาน] ที่บริษัท [ชื่อบริษัท] โดยในระหว่างการทำงานที่นั่น ผมมีโอกาสได้ทำงานร่วมกับทีมพัฒนาที่มีความสามารถสูง และร่วมกันสร้างผลิตภัณฑ์ที่ไม่เพียงแต่ประสบความสำเร็จในการตอบโจทย์ผู้ใช้ แต่ยังได้รับการยอมรับในอุตสาหกรรมอีกด้วย

                    ความเชี่ยวชาญของผมเน้นไปที่ [ภาษาโปรแกรมที่คุณเชี่ยวชาญ เช่น JavaScript, Python, Java, ฯลฯ] และมีความชำนาญในการพัฒนาเว็บแอปพลิเคชันด้วยเฟรมเวิร์กต่างๆ เช่น [ชื่อเฟรมเวิร์ก เช่น React, Angular, Laravel, ฯลฯ] นอกจากนี้ผมยังสนใจในการพัฒนาแอปพลิเคชันมือถือและการเรียนรู้เครื่องจักร (Machine Learning) ซึ่งผมได้ทำงานในโปรเจคที่เกี่ยวข้องกับการวิเคราะห์ข้อมูลและการปรับปรุงประสิทธิภาพของระบบ

                    สิ่งที่ผมสนใจในการทำงานคือการแก้ไขปัญหาที่ท้าทาย โดยใช้เทคโนโลยีใหม่ๆ และการทำงานร่วมกับทีมที่มีความหลากหลายเพื่อให้ได้มาซึ่งแนวทางที่ดีที่สุดในการพัฒนาและส่งมอบโซลูชันที่มีคุณภาพสูง ผมเชื่อว่าการเรียนรู้และพัฒนาตนเองอย่างต่อเนื่องเป็นสิ่งที่สำคัญในยุคที่เทคโนโลยีเปลี่ยนแปลงไปอย่างรวดเร็ว ดังนั้น ผมจึงให้ความสำคัญกับการเรียนรู้ทักษะใหม่ๆ และการปรับตัวให้ทันกับแนวโน้มในอุตสาหกรรม

                    ในเวลาว่าง ผมมักจะสนใจในกิจกรรมที่เกี่ยวกับการพัฒนาตนเอง เช่น การอ่านหนังสือเกี่ยวกับเทคโนโลยีใหม่ๆ การเข้าร่วมคอมมูนิตี้ต่างๆ เพื่อแลกเปลี่ยนความรู้ และการทดลองสร้างโปรเจคใหม่ๆ เพื่อต่อยอดทักษะที่เรียนรู้มา ผมยังมีความสนใจในการเรียนรู้ด้านการออกแบบประสบการณ์ผู้ใช้ (UX) และการพัฒนาเว็บไซต์ที่ตอบสนองความต้องการของผู้ใช้ให้ได้มากที่สุด

                    เป้าหมายในอนาคตของผมคือ การเติบโตในสายงานนักพัฒนาและการมีส่วนร่วมในโครงการที่สามารถช่วยขับเคลื่อนสังคมให้ดีขึ้น ผมหวังว่าจะได้ร่วมงานกับทีมที่มีความหลากหลายและเปิดกว้างในการแลกเปลี่ยนความคิดเห็น รวมถึงการพัฒนาเทคโนโลยีที่สามารถทำให้ชีวิตของผู้คนสะดวกสบายและมีคุณภาพมากยิ่งขึ้น
                    ขอบคุณที่สละเวลามาอ่านบทแนะนำตัวของผมครับ/ค่ะ
                    
                </p>
                <div className="flex justify-center items-center mt-4">
                    <img src="https://cdn.discordapp.com/attachments/920144008326569994/1368985856442105866/16b780ab6d2f852a.jpg?ex=681a36ee&is=6818e56e&hm=6964c6dd79e1aaa088d8cf365f4787d969e47dca98eedccc51fe9e3d5fcaaf09&" alt="Face" className="w-56 rounded-full" />
                </div>
          <section className="flex justify-center items-center mt-4" id="Clients">
            <img src="https://cdn.discordapp.com/attachments/842442154977656833/1368974737379819560/IMG_1485.png?ex=681a2c93&is=6818db13&hm=919846acd34c2a0d04c543d7c1f5312840bbf426e716ccc26dcffae138d61bc3&" alt="" />
          </section>

        </main>
    );
}
export default Main;